Repository: tonyInfonet/gpos-kpos
Catalog: InfonetPOS.Core/Resources/AppResources.*.resx
Languages: ar

source: Fuel Server Not Available
ar: خادم الوقود غير متوفر

source: Payment Solution Not Available
ar: حل الدفع غير متوفر

source: Shift
ar: وردية العمل

source: Till
ar: المحفظة

source: UserName
ar: إسم المستخدم

source: Fuel Grade
ar: نوع الوقود

# GotoToPump
source: GO TO PUMP {0} AND LIFT NOZZLE TO BEGIN FUELING
ar: انتقل إلى المضخة {0} و إرفع الفوهة للتزود بالوقود

source: PAYMENT APPROVED
ar: تم إعتماد الدفع

source: Payment Method
ar: طريقة الدفع

source: PAYMENT NOT APPROVED
ar: الدفع غير معتمد

# PrepayForPump
source: Prepay for pump: {0}
ar: الدفع المسبق للمضخة: {0}

source: Printing Receipt...
ar: إيصال الطباعة ...

source: PROCESSING….
ar: ...معالجة

source: TO PROCESS PAYMENT
ar: لعملية الدفع

# UsePaymentTerminal
source: PLEASE USE PAYMENT TERMINAL
ar: يرجى استخدام الدفع النهائي

source: REFUND
ar: إعادة مال

# CantAuthorizePump
source: CAN NOT AUTHORIZE PUMP
ar: لا يمكن تفويض مضخة

# PartialPumping
source: PARTIALLY PUMPED
ar: مضغوط جزئيا

source: Calculate Amount
ar: حساب المبلغ

source: Converted Amount
ar: المبلغ بعد تحويل العملة

source: Exchange Rate
ar: سعر الصرف

source: Confirm
ar: تأكيد

source: Select Payment Method
ar: إختيار طريقة الدفع

source: Select Refund Method
ar: إختار طريقة الإسترداد

source: Refund Approved
ar: تم إعتماد الإسترجاع

source: Refund Not Approved
ar: برد غير معتمد

source: Amount Paid
ar: المبلغ المدفوع

source: Amount Payable
ar: المبلغ المراد دفعة

source: Amount To Return
ar: المبلغ المسترجع

# PrepayRemoved
source: PREPAY HAS BEEN REMOVED
ar: تم إزالة نظام الدفع المسبق

# EOD
source: EOD Report
ar: تقرير نهاية اليوم

# EODDetail
source: Detailed EOD Report
ar: تقرير مفصل لنهاية اليوم

# GasPriceChange
source: Gas Price Change Report
ar: تقرير تغيير سعر الوقود

# HourlyGasSales
source: Gas Sales Hourly Report
ar: تقرير مبيعات الوقود لكل ساعة

source: Reports
ar: التقارير

source: Show Report
ar: عرض تقرير

source: Start Date
ar: تاريخ البدء

source: Cancel
ar: الغاء

source: End Date
ar: تاريخ الانتهاء

source: Print Report
ar: اطبع تقرير

source: Printing Report
ar: تقرير الطباعة

# CloseTill
source: Do you want to close the till?
ar: هل تريد إغلاق حتى؟

source: LOGOUT
ar: الخروج من النظام

source: Change
ar: المتبقي

source: Paid
ar: دفع

source: Price
ar: السعر

source: Pump
ar: مضخة

source: Total
ar: مجموع

source: Volume
ar: الكمية

source: Prepay
ar: الدفع المسبق

source: NO
ar: لا

source: YES
ar: نعم فعلا

source: Reprint Receipt
ar: إعادة طبع الإيصال

source: Print
ar: طباعة

source: Next Day
ar: اليوم التالي

source: Previous Day
ar: اليوم السابق

# ReceiptsFor
source: Receipts For {0}
ar: {0} إيصالات ل

source: Login
ar: لدخول للنظام

source: SET AMOUNT
ar: ادخل المبلغ

source: Current Sales
ar: المبيعات الحالية

source: Refund Method
ar: طريقة استرداد

# StartAll
source: Start All Pumps
ar: بدء جميع المضخات

# StopAll
source: Stop All Pumps
ar: وقف جميع المضخات

source: Drive Off
ar: طرد قبالة

# DriveOffMessage
source: Complete As Drive Off?
ar: أكمل طرد؟

# WantToStartPumps
source: Do You Want To Start All Pumps?
ar: هل تريد أن تبدأ جميع المضخات

# WantToStopPumps
source: Do You Want TO Stop All Pumps?
ar: هل تريد وقف جميع المضخات

source: Fuel Price Change
ar: تغيير سعر الوقود

source: Current Price
ar: السعر الحالي

source: Type
ar: نوع

source: New Price
ar: سعر جديد

source: Set
ar: جلس

source: Pump Test
ar: اختبار مضخة

# PumpTestMessage
source: Complete As Pump Test?
ar: أكمل اختبار مضخة؟

source: Authorize for pump test
ar: إذن لاختبار المضخة

# WantToAuthorizeForPumpTest
source: Do you want to authorize for pump test?
ar: هل تريد التفويض لاختبار المضخة؟

# ContactDealer
source: PLEASE CONTACT YOUR DEALER
ar: يرجى الاتصال تاجر الخاص بك

# NoPermissionToLogIn
source: YOU DON’T HAVE PERMISSION TO LOGIN TO POS
ar: أنت لا تملك إذنًا لتسجيل الدخول إلى نقاط البيع

source: Receipt Type
ar: نوع الإيصال

source: Date
ar: تاريخ

# CantCloseApp
source: You are in the middle of a transaction. Please complete or cancel the transaction before you close the application.
ar: أنت في منتصف الصفقة. يرجى إكمال أو إلغاء المعاملة قبل إغلاق التطبيق.

source: Next
ar: التالى

source: Previous
ar: السابق

source: Invoice
ar: فاتورة

source: DateTime
ar: تاريخ الوقت

# ConnectionLoseWhileLogin
source: Connection to Back office/FCS lost. Please check your network/WIFI connection. Do you want to try again?
ar: اتصال إلى المكتب الخلفي. يرجى التحقق من اتصال الشبكة / واي فاي الخاص بك. هل تريد اعادة المحاولة؟

# ConnectionLoseWhileLogout
source: Connection to Back office/FCS lost, please ensure your network/WIFI connection is ok and try again.
ar: الاتصال بالمكتب الخلفي ، يرجى التأكد من اتصال الشبكة الخاص بك على ما يرام والمحاولة مرة أخرى.

# CancelHoldBasketError
source: Basket hold can't be cancelled.Try again after sometimes.
ar: سلة سلة لا يمكن إلغاؤها. حاول مرة أخرى بعد في بعض الأحيان.

# RefundNotApprovedForPrepayRefund
source: Refund Not approved.Please contact with cashier.
ar: برد لم تتم الموافقة. يرجى الاتصال مع أمين الصندوق.

# CantAuthorizePostPay
source: Cant Authorize pump for postpay. Try Again after somethimes.
ar: لا يمكن تفويض المضخة للدفع الآجل. حاول مرة أخرى بعد بعض الأحيان.

# CantStartPump
source: Can't start pump.Please Try Again After sometimes.
ar: لا يمكن أن تبدأ مضخة. يرجى المحاولة مرة أخرى بعد بعض الأحيان.

# CantStopPump
source: Can't stop pump.Please Try Again After sometimes.
ar: لا يمكن أن تتوقف مضخة. يرجى المحاولة مرة أخرى بعد في بعض الأحيان.

# PrepayHoldError
source: PrepayHold Error Occurred.Try Again after sometimes.
ar: حدث خطأ الدفع المسبق. حاول مرة أخرى بعد بعض الأحيان.

# BasketHoldError
source: Can't Hold Basket.Try again after sometimes.
ar: لا يمكن أن تعقد سلة. حاول مرة أخرى بعد في بعض الأحيان.

# CantSetPrice
source: Can't set price. Try again after sometimes.
ar: لا يمكن تحديد السعر. حاول مرة أخرى بعد بعض الأحيان.

# CantStartAllPump
source: Can't Start all pump.Try Again after sometimes.
ar: لا يمكن بدء جميع المضخات. حاول مرة أخرى بعد بعض الأحيان.

# CantStopAllPump
source: Can't Stop all pump.Try again after sometimes.
ar: لا يمكن إيقاف جميع المضخات. حاول مرة أخرى بعد بعض الأحيان.

# CantSwitchPrepay
source: Can't Switch prepay.Try again after sometimes.
ar: لا يمكن تبديل الدفع المسبق. حاول مرة أخرى بعد بعض الأحيان.

# PrepayCancelHoldRemoveError
source: Prepay cancel hold remove error occurred.Try again after sometimes.
ar: الدفع المسبق لإلغاء الحجز حدث خطأ الإزالة. حاول مرة أخرى بعد أحيانًا.

# PrepayHoldRemoveError
source: Prepay Hold Remove error occurred. Try again.
ar: حدث الدفع المسبق إزالة حدث خطأ. حاول مجددا.

# CantAuthorizeForPumpTest
source: Can't Authorize for pump test.Please try again.
ar: لا يمكن التصريح لاختبار المضخة. يرجى المحاولة مرة أخرى.

source: Password
ar: كلمه السر

# EnterPassword
source: Please enter password to login.
ar: الرجاء إدخال كلمة المرور لتسجيل الدخول.

# WrongPassword
source: Password is incorrect.
ar: كلمة المرور غير صحيحة.
